import datetime
import time
from datetime import datetime as dt,date,time as dttime, timedelta


def get_week_day(date):
    week_day_dict = {0: '星期一',
                     1: '星期二',
                     2: '星期三',
                     3: '星期四',
                     4: '星期五',
                     5: '星期六',
                     6: '星期天', }
    day = date.weekday()
    return week_day_dict[day]


def get_now_time():
    now_time = dt.now()
    now_week = get_week_day(now_time)
    return now_time.strftime('%Y-%m-%d'), now_week


def get_no_format_time():
    now_time = dt.now()
    return now_time


def early_content(request):
    date_time = dt.now()
    now_week = get_week_day(date_time)
    now_date = date_time.strftime('%Y-%m-%d')
    now_time = date_time.strftime('%H%M%S')

    content_dict = {'星期一': {'0': ' ^_^  早啊，迎接元气满满的一天吧，记得吃早餐！',
                            '1': ' ^_^  大抵知心有庭树，亭亭一如你风致！',
                            '2': ' ^_^  幸得识卿桃花面，从此阡陌多暖意！',
                            '3': ' ^_^  斯人如虹，遇上方只有！',
                            '4': ' ^_^  一瞥便是惊鸿',
                            '5': ' ^_^  人生自是有情痴，此恨不关风和月！',
                            '6': ' ^_^  众人是草木，唯你是青山！',
                            '7': ' ^_^  失而复得，久别重逢，虚惊一场，唯独缺少和好如初',
                            '8': ' ^_^  江湖路远，同去同归！',
                            '9': ' ^_^  失而复得，久别重逢，虚惊一场，唯独缺少和好如初',
                            '10': ' ^_^  吃过晚餐，早点下班吧，生活不只有工作喔！',
                            '11': ' ^_^  我们都是夜归人，共勉！', },
                    '星期二': {'0': ' ^_^  早啊，迎接元气满满的一天吧，记得吃早餐！',
                            '1': ' ^_^  大抵知心有庭树，亭亭一如你风致！',
                            '2': ' ^_^  幸得识卿桃花面，从此阡陌多暖意！',
                            '3': ' ^_^  斯人如虹，遇上方只有！',
                            '4': ' ^_^  一瞥便是惊鸿',
                            '5': ' ^_^  人生自是有情痴，此恨不关风和月！',
                            '6': ' ^_^  众人是草木，唯你是青山！',
                            '7': ' ^_^  失而复得，久别重逢，虚惊一场，唯缺和好如初',
                            '8': ' ^_^  入目无他人，四下皆是你！',
                            '9': ' ^_^  入目无他人，四下皆是你',
                            '10': ' ^_^  吃过晚餐，早点下班吧，生活不只有工作喔！',
                            '11': ' ^_^  我们都是夜归人，共勉！', },
                    '星期三': {'0': ' ^_^  早啊，迎接元气满满的一天吧，记得吃早餐！',
                            '1': ' ^_^  生活原本沉闷，但跑起来就有风！',
                            '2': ' ^_^  你未必出类拔萃，但一定与众不同！',
                            '3': ' ^_^  别羡慕她的漂亮，总有人爱上你的善良！',
                            '4': ' ^_^  做自己的太阳，着凉那些烦恼和沮丧',
                            '5': ' ^_^  能饮得下烈酒，也能熬得过寒冬！',
                            '6': ' ^_^  众人是草木，唯你是青山！',
                            '7': ' ^_^  一笔一划诉春秋，一撇一捺秀温柔，一动一静情无限',
                            '8': ' ^_^  江湖路远，同去同归！',
                            '9': ' ^_^  一笔一划诉春秋，一撇一捺秀温柔，一动一静情无限',
                            '10': ' ^_^  吃过晚餐，早点下班吧，生活不只有工作喔！',
                            '11': ' ^_^  我们都是夜归人，共勉！', },
                    '星期四': {'0': ' ^_^  早啊，迎接元气满满的一天吧，记得吃早餐！',
                            '1': ' ^_^  生活原本沉闷，但跑起来就有风！',
                            '2': ' ^_^  你未必出类拔萃，但一定与众不同！',
                            '3': ' ^_^  别羡慕她的漂亮，总有人爱上你的善良！',
                            '4': ' ^_^  做自己的太阳，着凉那些烦恼和沮丧',
                            '5': ' ^_^  能饮得下烈酒，也能熬得过寒冬！',
                            '6': ' ^_^  众人是草木，唯你是青山！',
                            '7': ' ^_^  人生自是有情痴，此恨不关风和月',
                            '8': ' ^_^  青涩不及当初，聚散不由你我！',
                            '9': ' ^_^  青涩不及当初，聚散不由你我',
                            '10': ' ^_^  吃过晚餐，早点下班吧，生活不只有工作喔！',
                            '11': ' ^_^  我们都是夜归人，共勉！', },
                    '星期五': {'0': ' ^_^  早啊，迎接元气满满的一天吧，记得吃早餐！',
                            '1': ' ^_^  大抵知心有庭树，亭亭一如你风致！',
                            '2': ' ^_^  幸得识卿桃花面，从此阡陌多暖意！',
                            '3': ' ^_^  斯人如虹，遇上方只有！',
                            '4': ' ^_^  图他年纪大，图他不洗澡，图他三室一厅可以跑步',
                            '5': ' ^_^  人生自是有情痴，此恨不关风和月！',
                            '6': ' ^_^  众人是草木，唯你是青山！',
                            '7': ' ^_^  精心打扮去见最可爱的可人儿',
                            '8': ' ^_^  出发,现在就准备起航',
                            '9': ' ^_^  你不知见你就笑的人有多喜欢你',
                            '10': ' ^_^  你更不知见你就低头假装若无其事的人有多爱你！',
                            '11': ' ^_^  我们都是夜归人，共勉！', },
                    '星期六': {'0': '^_^ 2020-0202，抓住这个时间，要是错过了，请抓住20211202！',
                            '1': ' ^_^  2020-0202，抓住这个时间，要是错过了，请抓住20211202！',
                            '2': ' ^_^  2020-0202，抓住这个时间，要是错过了，请抓住20211202！',
                            '3': ' ^_^  2020-0202，抓住这个时间，要是错过了，请抓住20211202！',
                            '4': ' ^_^  2020-0202，抓住这个时间，要是错过了，请抓住20211202',
                            '5': ' ^_^  2020-0202，抓住这个时间，要是错过了，请抓住20211202！',
                            '6': ' ^_^  2020-0202，抓住这个时间，要是错过了，请抓住20211202！',
                            '7': ' ^_^  2020-0202，抓住这个时间，要是错过了，请抓住20211202！',
                            '8': ' ^_^  2020-0202，抓住这个时间，要是错过了，请抓住20211202',
                            '9': ' ^_^  2020-0202，抓住这个时间，要是错过了，请抓住20211202',
                            '10': ' ^_^  吃过晚餐，早点下班吧，生活不只有工作喔！',
                            '11': ' ^_^  我们都是夜归人，共勉！', },
                    '星期天': {'0': ' ^_^  早啊，迎接元气满满的一天吧，记得吃早餐！',
                            '1': ' ^_^  再坚持几天，周末就要来了！',
                            '2': ' ^_^  在忙也记得喝水喔！',
                            '3': ' ^_^  吃个午饭，午休一下吧，别太累了喔！',
                            '4': ' ^_^  永远相信美好的事情将要发生！',
                            '5': ' ^_^  你遥想的未来在何方！',
                            '6': ' ^_^  最美的不是下雨天，是曾与你躲过雨的屋檐！',
                            '7': '高中三年我，为什么不好好读书，没考上跟你一样的大学！',
                            '8': ' ^_^  曾梦想仗剑走天涯，看一看世间的繁华！',
                            '9': ' ^_^  晓看天色暮看云，行也思君，坐也思君！',
                            '10': ' ^_^  吃过晚餐，早点下班吧，生活不只有工作喔！',
                            '11': ' ^_^  我们都是夜归人，共勉！', }}

    # content_dict = {'星期一': {'0': '( ^_^ ) 早啊，迎接元气满满的一天吧，记得吃早餐！',
    #                         # '1': '( ^_^ ) 再坚持几天，周末就要来了！',
    #                         # '1': '( ^_^ ) 醉过才知酒浓，爱过才知情重！',
    #                         # '2': '( ^_^ ) 在忙也记得喝水喔！',
    #                         # '3': '( ^_^ ) 吃个午饭，午休一下吧，别太累了喔！',
    #                         # '4': '( ^_^ ) 永远相信美好的事情将要发生！',
    #                         # '5': '( ^_^ ) 你遥想的未来在何方！',
    #                         # '6': '( ^_^ ) 最美的不是下雨天，是曾与你躲过雨的屋檐！',
    #                         # '7': '高中三年我，为什么不好好读书，没考上跟你一样的大学！',
    #                         # '8': '( ^_^ ) 曾梦想仗剑走天涯，看一看世间的繁华！',
    #                         # '9': '( ^_^ ) 晓看天色暮看云，行也思君，坐也思君！',
    #                         # '10': '( ^_^ ) 吃过晚餐，早点下班吧，生活不只有工作喔！',
    #                         # '11': '( ^_^ ) 我们都是夜归人，共勉！', },
    #
    #                         '1': '( ^_^ ) 大抵知心有庭树，亭亭一如你风致！',
    #                         '2': '( ^_^ ) 幸得识卿桃花面，从此阡陌多暖意！',
    #                         '3': '( ^_^ ) 大抵知心有庭树，亭亭一如你风致！',
    #                         '4': '( ^_^ ) 幸得识卿桃花面，从此阡陌多暖意！',
    #                         '5': '( ^_^ ) 大抵知心有庭树，亭亭一如你风致！',
    #                         '6': '( ^_^ ) 幸得识卿桃花面，从此阡陌多暖意！',
    #                         '7': '( ^_^ ) 幸得识卿桃花面，从此阡陌多暖意！',
    #                         '8': '( ^_^ ) 大抵知心有庭树，亭亭一如你风致！',
    #                         '9': '( ^_^ ) 幸得识卿桃花面，从此阡陌多暖意！',
    #                         '10': '( ^_^ ) 吃过晚餐，早点下班吧，生活不只有工作喔！',
    #                         '11': '( ^_^ ) 我们都是夜归人，共勉！', },
    #
    #                 '星期二': {'0': '( ^_^ ) 早啊，迎接元气满满的一天吧，记得吃早餐！',
    #                         '1': '( ^_^ ) 再坚持几天，周末就要来了！',
    #                         '2': '( ^_^ ) 在忙也记得喝水喔！',
    #                         '3': '( ^_^ ) 吃个午饭，午休一下吧，别太累了喔！',
    #                         '4': '( ^_^ ) 永远相信美好的事情将要发生！',
    #                         # '5': '( ^_^ ) 你遥想的未来在何方！',
    #                         '5': '( ^_^ ) 青石板的老街上，你我走过的地方那段斑驳的砖墙！',
    #                         '6': '( ^_^ ) 未来是你的，也是我的！',
    #                         '7': '高中三年我，为什么不好好读书，没考上跟你一样的大学！',
    #                         '8': '( ^_^ ) 曾梦想仗剑走天涯，看一看世间的繁华！',
    #                         '9': '( ^_^ ) 晓看天色暮看云，行也思君，坐也思君！',
    #                         '10': '( ^_^ ) 吃过晚餐，早点下班吧，生活不只有工作喔！',
    #                         '11': '( ^_^ ) 我们都是夜归人，共勉！', },
    #                 '星期三': {'0': '( ^_^ ) 早啊，迎接元气满满的一天吧，记得吃早餐！',
    #                         '1': '( ^_^ ) 再坚持几天，周末就要来了！',
    #                         '2': '( ^_^ ) 在忙也记得喝水喔！',
    #                         '3': '( ^_^ ) 吃个午饭，午休一下吧，别太累了喔！',
    #                         '4': '( ^_^ ) 永远相信美好的事情将要发生！',
    #                         # '5': '( ^_^ ) 你遥想的未来在何方！',
    #                         '5': '( ^_^ ) 时间会把最好的留给你，毕竟喜欢是一阵子，爱是细水长流！',
    #                         '6': '( ^_^ ) 时间会把最好的留给你，毕竟喜欢是一阵子，爱是细水长流！！',
    #                         # '6': '( ^_^ ) 最美的不是下雨天，是曾与你躲过雨的屋檐！',
    #                         '7': '高中三年我，为什么不好好读书，没考上跟你一样的大学！',
    #                         '8': '( ^_^ ) 曾梦想仗剑走天涯，看一看世间的繁华！',
    #                         '9': '( ^_^ ) 晓看天色暮看云，行也思君，坐也思君！',
    #                         '10': '( ^_^ ) 吃过晚餐，早点下班吧，生活不只有工作喔！',
    #                         '11': '( ^_^ ) 我们都是夜归人，共勉！', },
    #                 '星期四': {'0': '( ^_^ ) 早啊，迎接元气满满的一天吧，记得吃早餐！',
    #                         '1': '( ^_^ ) 再坚持几天，周末就要来了！',
    #                         '2': '( ^_^ ) 在忙也记得喝水喔！',
    #                         '3': '( ^_^ ) 吃个午饭，午休一下吧，别太累了喔！',
    #                         '4': '( ^_^ ) 永远相信美好的事情将要发生！',
    #                         '5': '( ^_^ ) 你遥想的未来在何方！',
    #                         '6': '( ^_^ ) 最美的不是下雨天，是曾与你躲过雨的屋檐！',
    #                         '7': '高中三年我，为什么不好好读书，没考上跟你一样的大学！',
    #                         '8': '( ^_^ ) 曾梦想仗剑走天涯，看一看世间的繁华！',
    #                         '9': '( ^_^ ) 晓看天色暮看云，行也思君，坐也思君！',
    #                         '10': '( ^_^ ) 吃过晚餐，早点下班吧，生活不只有工作喔！',
    #                         '11': '( ^_^ ) 我们都是夜归人，共勉！', },
    #                 '星期五': {'0': '( ^_^ ) 早啊，迎接元气满满的一天吧，记得吃早餐！',
    #                         '1': '( ^_^ ) 再坚持几天，周末就要来了！',
    #                         '2': '( ^_^ ) 在忙也记得喝水喔！',
    #                         '3': '( ^_^ ) 吃个午饭，午休一下吧，别太累了喔！',
    #                         '4': '( ^_^ ) 永远相信美好的事情将要发生！',
    #                         '5': '( ^_^ ) 你遥想的未来在何方！',
    #                         '6': '( ^_^ ) 最美的不是下雨天，是曾与你躲过雨的屋檐！',
    #                         '7': '高中三年我，为什么不好好读书，没考上跟你一样的大学！',
    #                         # '8': '( ^_^ ) 曾梦想仗剑走天涯，看一看世间的繁华！',
    #                         '8': '( ^_^ ) 愿惦念之人岁岁平安即使生生不见！',
    #                         '9': '( ^_^ ) 晓看天色暮看云，行也思君，坐也思君！',
    #                         '10': '( ^_^ ) 吃过晚餐，早点下班吧，生活不只有工作喔！',
    #                         '11': '( ^_^ ) 我们都是夜归人，共勉！', },
    #                 '星期六': {'0': '( ^_^ ) 早啊，迎接元气满满的一天吧，记得吃早餐！',
    #                         '1': '( ^_^ ) 再坚持几天，周末就要来了！',
    #                         '2': '( ^_^ ) 在忙也记得喝水喔！',
    #                         '3': '( ^_^ ) 吃个午饭，午休一下吧，别太累了喔！',
    #                         '4': '( ^_^ ) 永远相信美好的事情将要发生！',
    #                         '5': '( ^_^ ) 你遥想的未来在何方！',
    #                         '6': '( ^_^ ) 最美的不是下雨天，是曾与你躲过雨的屋檐！',
    #                         '7': '高中三年我，为什么不好好读书，没考上跟你一样的大学！',
    #                         '8': '( ^_^ ) 曾梦想仗剑走天涯，看一看世间的繁华！',
    #                         '9': '( ^_^ ) 晓看天色暮看云，行也思君，坐也思君！',
    #                         '10': '( ^_^ ) 吃过晚餐，早点下班吧，生活不只有工作喔！',
    #                         '11': '( ^_^ ) 我们都是夜归人，共勉！', },
    #                 '星期天': {'0': '( ^_^ ) 早啊，迎接元气满满的一天吧，记得吃早餐！',
    #                         '1': '( ^_^ ) 再坚持几天，周末就要来了！',
    #                         '2': '( ^_^ ) 在忙也记得喝水喔！',
    #                         '3': '( ^_^ ) 吃个午饭，午休一下吧，别太累了喔！',
    #                         '4': '( ^_^ ) 永远相信美好的事情将要发生！',
    #                         '5': '( ^_^ ) 你遥想的未来在何方！',
    #                         '6': '( ^_^ ) 最美的不是下雨天，是曾与你躲过雨的屋檐！',
    #                         '7': '高中三年我，为什么不好好读书，没考上跟你一样的大学！',
    #                         '8': '( ^_^ ) 曾梦想仗剑走天涯，看一看世间的繁华！',
    #                         '9': '( ^_^ ) 晓看天色暮看云，行也思君，坐也思君！',
    #                         '10': '( ^_^ ) 吃过晚餐，早点下班吧，生活不只有工作喔！',
    #                         '11': '( ^_^ ) 我们都是夜归人，共勉！', }}

    # 计算当前时间和日期
    content = ""
    hour = now_time[0:4]
    now_day_content = content_dict[now_week]
    if 800 < int(hour) <= 1000:
        content = now_day_content.get('0', '')
    elif 1000 < int(hour) <= 1100:
        content = now_day_content.get('1', '')
    elif 1100 < int(hour) <= 1130:
        content = now_day_content.get('2', '')
    elif 1130 < int(hour) <= 1330:
        content = now_day_content.get('3', '')
    elif 1330 < int(hour) <= 1400:
        content = now_day_content.get('4', '')
    elif 1400 < int(hour) <= 1430:
        content = now_day_content.get('5', '')
    elif 1430 < int(hour) <= 1525:
        content = now_day_content.get('6', '')
    elif 1525 < int(hour) <= 1540:
        content = now_day_content.get('7', '')
    elif 1540 < int(hour) <= 1800:
        content = now_day_content.get('8', '')
    elif 1800 < int(hour) <= 1930:
        content = now_day_content.get('9', '')
    elif 1930 < int(hour) <= 2000:
        content = now_day_content.get('10', '')
    elif 2000 < int(hour) <= 2399:
        content = now_day_content.get('11', '')

    # print(content)
    return {'hello_content': content}


def string_to_timestamp(str):
    """
    :param str:
    :return:
    """
    datetimeStr = dt.strptime(str,'%Y-%m-%d %H:%M:%S')
    return time.mktime(datetimeStr.timetuple())


def datetime_to_str(datetime,format=None):
    """
    :param str:
    :return:
    """
    if not isinstance(datetime,dt):
        raise TypeError(f'datetime_to_str input must a datetime,you input type is {type(datetime)}')
    if format is None:
        return dt.strftime(datetime,'%Y-%m-%d %H:%M:%S')
    else:
        return dt.strftime(datetime,format)

def now_str(format=None):
    if format is None:
        format = '%Y-%m-%d %H:%M:%S'
    return dt.now().strftime(format)


def inttimestamp_to_datetime(int):
    return dt.fromtimestamp(int)


def week_range(day)->list:
    """
    查询某一天的这个星期范围
    Parameters
    ----------
    day :

    Returns list of datetime
    -------

    """
    if not isinstance(day,(dt,date)):
        raise TypeError(f'week_range input must a datetime or date,you input type is {type(day)}')
    if isinstance(day,dt):
        start = day-timedelta(days=day.weekday())
        start = start.date()
    else:
        start = day-timedelta(days=day.weekday())
    start = dt.combine(start, dttime.min)
    end = start + timedelta(days = 7)

    return [start,end]


def last_month(dateTime=None):
    if dateTime is None:
        dateTime = datetime.datetime.now()
    if not isinstance(dateTime,dt):
        raise TypeError(f'dateTime must datetime ,you input type is {type(datetime)}')
    nowYear = dateTime.year
    nowMonth = dateTime.month
    if nowMonth == 1:
        return [nowYear-1,12]
    else:
        return [nowYear,nowMonth-1]


if __name__ == '__main__':
    print(now_str())